AccumulationRegisters/ОстаткиТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваровКомпании</Name>
			<Comment>Блок учета остатков товаров компании</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток номенклатуры на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент или подразделение получатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ШтрихкодыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТК_ДанныеИнвентаризацийТСД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТК_ДанныеИнвентаризацийТСД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Продажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтрагента</Name>
					<Comment>Вид контрагента</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическоеФизическоеЛицо</Name>
					<Comment>Реквизит введен для совместимости с Библиотекой типов и не выводится в пользовательский интерфейс. Заполняется автоматически по данным реквзита ЮрФизЛицо.</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ЮридическоеФизическоеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлательщикНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоЕДРПОУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСвидетельстваПлательщикаНДС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННПлательщикаНДС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодФилиала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GLN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Comment>Используется при анализе первичного интереса</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Дополнительная информация о контрагенте</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодWERA</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаРаботы</Name>
					<Comment>1 - Корректировка 2 - Замена накладных</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьПротоколыЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводительИмпортерТабак</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Comment>Тип</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Comment>Вид</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Comment>Свойство</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ТК_ТСД_РаботаWebСервиса/Ext/Module.bsl
Функция ВернутьТекстЗапросаПоНоменклатуре_ДляТСД() 
	
	//		              |	{Условие}

	ТекстЗапроса ="ВЫБРАТЬ
	              |	спрСкладыКомпании.Ссылка КАК Склад
	              |ПОМЕСТИТЬ ВТ_Склады
	              |ИЗ
	              |	Справочник.СкладыКомпании КАК спрСкладыКомпании
	              |ГДЕ
	              |	спрСкладыКомпании.Ссылка = &Склад
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура КАК Номенклатура,
	              |	ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоНачальныйОстаток КАК КоличествоНачальныйОстаток,
	              |	ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоКонечныйОстаток КАК КоличествоКонечныйОстаток,
	              |	ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоОборот КАК КоличествоОборот,
	              |	ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоПриход КАК КоличествоПриход,
	              |	ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоРасход КАК КоличествоРасход
	              |ПОМЕСТИТЬ ВТ_Движ
	              |ИЗ
	              |	РегистрНакопления.ОстаткиТоваровКомпании.ОстаткиИОбороты(
	              |			&НачПериода,
	              |			&КонПериода,
	              |			,
	              |			,
	              |			СкладКомпании В
	              |				(ВЫБРАТЬ
	              |					ВТ_Склады.Склад
	              |				ИЗ
	              |					ВТ_Склады КАК ВТ_Склады)) КАК ОстаткиТоваровКомпанииОстаткиИОбороты
	              |
	              |ИНДЕКСИРОВАТЬ ПО
	              |	Номенклатура
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ВТ_Движ.Номенклатура КАК Номенклатура,
	              |	ШтрихКоды.Штрихкод КАК Штрихкод,
	              |	ВТ_Движ.Номенклатура.Артикул КАК Артикул,
	              |	ВТ_Движ.Номенклатура.Наименование КАК Наименование,
	              |	1 КАК Коэффициент
	              |ИЗ
	              |	ВТ_Движ КАК ВТ_Движ
	              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихКоды
	              |		ПО ВТ_Движ.Номенклатура = ШтрихКоды.Номенклатура
	              |
	              |УПОРЯДОЧИТЬ ПО
	              |	Наименование";
		
		
		Возврат ТекстЗапроса;
	
КонецФункции	

Функция ВернутьТЗ_Контрагенты_ДляТСД_Инвентаризация()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Владелец,
	|	Контрагенты.Код КАК ВладелецКод,
	|	Контрагенты.Наименование КАК ВладелецНаименование,
	|	Контрагенты.КодПоЕДРПОУ КАК ВладелецКодПоОКПО
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ПометкаУдаления = ЛОЖЬ
	|	И Контрагенты.КодПоЕДРПОУ ПОДОБНО ""tsd%""";
	
	тзРез = Запрос.Выполнить().Выгрузить();
	Возврат тзРез;
КонецФункции // ()

Функция Преобразовать_XDTO_ВТаблицуЗначений(ПространствоИмен, ИмяПакета_XDTO, Список_XDTO)
	РезТип = ФабрикаXDTO.Тип(ПространствоИмен, ИмяПакета_XDTO);
	тз = Новый ТаблицаЗначений;
	Для каждого Свойство Из РезТип.Свойства Цикл
		тз.Колонки.Добавить(Свойство.Имя);
	КонецЦикла;
	// Создание описателя типов для таблицы значений
	Массив = Новый Массив;
	Массив.Добавить(Тип("Булево"));
	ОписаниеТипов = Новый ОписаниеТипов(Массив, , );
	тз.Колонки.Добавить("Обработан", ОписаниеТипов);
	тз.Колонки.Добавить("ЭтоИнвентаризация", ОписаниеТипов);
	Для каждого ЭлСписка Из Список_XDTO Цикл
		стз = тз.Добавить();
		Для каждого Свойство Из РезТип.Свойства Цикл
			Если Свойство.Имя = "DocNumber" И Лев(ЭлСписка[Свойство.Имя], 3) = "inv" Тогда
				стз.ЭтоИнвентаризация = Истина;
			КонецЕсли; 
			стз[Свойство.Имя] = ЭлСписка[Свойство.Имя];
		КонецЦикла; 
	КонецЦикла; 
	
	Возврат тз;
	
КонецФункции // ПреобразоватьВТаблицуЗначений()

Функция ВернутьТаблицуТоваровПоАртикулу(СписокТоваровXDTO)
	Артикулы = Новый Массив;
	Для каждого СтрокаТовар Из СписокТоваровXDTO Цикл
		Артикулы.Добавить(СтрокаТовар.NomenclatureCode);
	КонецЦикла;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Артикул,
	|	Номенклатура.Ссылка
	|ПОМЕСТИТЬ Таб
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Артикул В(&Артикулы)
	|	И НЕ Номенклатура.ЭтоГруппа
	|	И НЕ Номенклатура.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таб.Артикул,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Таб.Ссылка) КАК КоличествоДублей
	|ПОМЕСТИТЬ Дубли
	|ИЗ
	|	Таб КАК Таб
	|
	|СГРУППИРОВАТЬ ПО
	|	Таб.Артикул
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таб.Артикул,
	|	Таб.Ссылка КАК Номенклатура,
	|	ЕСТЬNULL(Дубли.КоличествоДублей, 0) КАК КоличествоДублей,
	|	Таб.Ссылка.ОсновнаяЕдиницаИзмерения КАК ОсновнаяЕдиницаИзмерения
	|ИЗ
	|	Таб КАК Таб
	|		ЛЕВОЕ СОЕДИНЕНИЕ Дубли КАК Дубли
	|		ПО Таб.Артикул = Дубли.Артикул";
	Запрос.УстановитьПараметр("Артикулы", Артикулы);
	Результат = Запрос.Выполнить();
	
	тзРез = Результат.Выгрузить();
	Возврат тзРез;
	
КонецФункции // ВернутьТаблицуТоваровПоАртикулу()

Функция ЗаписатьВРегистрДанныхТСД(НомерДокумента,СкладКомпании,МассивТоваров,тзТовары,стрСообщение)
	
	ДокументОбработан=Ложь;
	
	Попытка
		НаборЗаписей = РегистрыСведений.ТК_ДанныеИнвентаризацийТСД.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.СкладКомпании.Установить(СкладКомпании);
		НаборЗаписей.Отбор.НомерДокумента.Установить(НомерДокумента);
		
		ДатаЗагрузки = ТекущаяДата();
		
		тзДанные = НаборЗаписей.ВыгрузитьКолонки();
		
		
		
		Для каждого СтрокаТовар Из МассивТоваров Цикл
			
			стзНоменклатура = тзТовары.Найти(СтрокаТовар.NomenclatureCode, "Артикул");
			Если стзНоменклатура = Неопределено Тогда
				стрСообщение = стрСообщение+СтрокаТовар.NomenclatureCode+";";
			Иначе
				
				НоваяЗапись = тзДанные.Добавить();
				НоваяЗапись.СкладКомпании  = СкладКомпании;
				НоваяЗапись.НомерДокумента = НомерДокумента;
				НоваяЗапись.Номенклатура   = стзНоменклатура.Номенклатура;
				НоваяЗапись.Количество     = СтрокаТовар.Qty;
				НоваяЗапись.ДатаЗагрузки   = ДатаЗагрузки;
			КонецЕсли;
		КонецЦикла;
		
		тзДанные.Свернуть("СкладКомпании,НомерДокумента,Номенклатура,ДатаЗагрузки","Количество");
		НаборЗаписей.Загрузить(тзДанные);
		
		Попытка
			НаборЗаписей.Записать();
			ДокументОбработан = Истина;	
		Исключение
			стрСообщение = стрСообщение + "Ошибка записи данных "+ОписаниеОшибки();
			
		КонецПопытки;
	Исключение
		стрСообщение = стрСообщение + "Ошибка записи данных "+ОписаниеОшибки();
		
	КонецПопытки;
	
	
	Возврат ДокументОбработан;
	
	
КонецФункции




Функция ВозвратНоменклатурыДляТСД_Инвентаризация(ПрефиксСклада) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	РезТип = ФабрикаXDTO.Тип("http://www.digma.ua", "NomenclatureForTSD_List");
	РезСтруктура = ФабрикаXDTO.Создать(РезТип);
	ЭлементТип = ФабрикаXDTO.Тип("http://www.digma.ua", "NomenclatureForTSD");
	
	Запрос = Новый Запрос;
	ТекстЗапроса =  ВернутьТекстЗапросаПоНоменклатуре_ДляТСД();
	Если СтрНайти(ПрефиксСклада,"-") > 0 Тогда
		МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПрефиксСклада,"-");
		СкладКомпании         = Справочники.СкладыКомпании.НайтиПоКоду(СокрЛП(МассивПодстрок[1]));
	Иначе
		СкладКомпании         = Справочники.СкладыКомпании.НайтиПоКоду(СокрЛП(ПрефиксСклада));
	КонецЕсли;
	
	

	
	Запрос.УстановитьПараметр("Склад", СкладКомпании);
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("НачПериода", ДобавитьМесяц(ТекущаяДата(),-1));
	Запрос.УстановитьПараметр("КонПериода", ТекущаяДата());
	тзРез = Запрос.Выполнить().Выгрузить();
	Для каждого Выборка Из тзРез Цикл
		Элемент = ФабрикаXDTO.Создать(ЭлементТип);
		Элемент.Code = Строка(Выборка.Артикул);
		Элемент.Barcode = Строка(Выборка.Штрихкод);
		Элемент.Name = Выборка.Наименование;
		Элемент.Inpack = Выборка.Коэффициент;
		РезСтруктура.NomenclatureList.Добавить(Элемент);
	КонецЦикла; 
	Возврат РезСтруктура;
	
КонецФункции // ВозвратНоменклатурыДляТСД()

Функция ВозвратКонтрагентовДляТСД_Инвентаризация() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	РезТип = ФабрикаXDTO.Тип("http://www.digma.ua", "ClientForTSD_List");
	РезСтруктура = ФабрикаXDTO.Создать(РезТип);
	ЭлементТип = ФабрикаXDTO.Тип("http://www.digma.ua", "ClientForTSD");
	
	тзРез = ВернутьТЗ_Контрагенты_ДляТСД_Инвентаризация();
	Для каждого Выборка Из тзРез Цикл
		Элемент = ФабрикаXDTO.Создать(ЭлементТип);
		Элемент.Code = ?(ЗначениеЗаполнено(Выборка.ВладелецКодПоОКПО), Выборка.ВладелецКодПоОКПО, Выборка.ВладелецКод);
		Элемент.Name = Выборка.ВладелецНаименование;
		РезСтруктура.ClientList.Добавить(Элемент);
	КонецЦикла; 
	Возврат РезСтруктура;
КонецФункции // ВозвратНоменклатурыДляТСД()



Функция СоздатьДокументыИзТСД(DocForTSD_List, ПрефиксСклада) Экспорт
	УстановитьПривилегированныйРежим(Истина);

	РезТип = ФабрикаXDTO.Тип("http://www.digma.ua", "ReturnDownloadStatusFor1C_List");
	РезСтруктура = ФабрикаXDTO.Создать(РезТип);
	ЭлементТип = ФабрикаXDTO.Тип("http://www.digma.ua", "ReturnDownloadStatusFor1C");
	
	
	Если СтрНайти(ПрефиксСклада,"-") > 0 Тогда
		МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПрефиксСклада,"-");
		СкладКомпании         = Справочники.СкладыКомпании.НайтиПоКоду(СокрЛП(МассивПодстрок[1]));
	Иначе
		СкладКомпании         = Справочники.СкладыКомпании.НайтиПоКоду(СокрЛП(ПрефиксСклада));
	КонецЕсли;
	
	
	СписокДокументовXDTO = DocForTSD_List.ПолучитьСписок("DocHeadForTSDList");
	СписокТоваровXDTO 	 = DocForTSD_List.ПолучитьСписок("DocTableForTSDList");
	
	тзXDTO = Преобразовать_XDTO_ВТаблицуЗначений("http://www.digma.ua", "DocTableForTSD", СписокТоваровXDTO);
	тзТоваровПоАртикулу = ВернутьТаблицуТоваровПоАртикулу(СписокТоваровXDTO);
	
	
	
	
	Для каждого СтрокаДокумент Из СписокДокументовXDTO Цикл
		МассивТоваров = тзXDTO.НайтиСтроки(Новый Структура("DocNumber", СтрокаДокумент.DocNumber));
		стрСообщение = "";

		
		ВсеОК = ЗаписатьВРегистрДанныхТСД(СтрокаДокумент.ClientCode,СкладКомпании,МассивТоваров,тзТоваровПоАртикулу,стрСообщение);
		Если ВсеОК Тогда
			Элемент = ФабрикаXDTO.Создать(ЭлементТип);
			Элемент.DocNumber = СтрокаДокумент.DocNumber;
			Элемент.StatusDownload = Истина;
			Элемент.Description = "Данные по товарам записаны успешно";
			РезСтруктура.ReturnDownloadStatusFor1CList.Добавить(Элемент);
		Иначе
			Элемент = ФабрикаXDTO.Создать(ЭлементТип);
			Элемент.DocNumber = СтрокаДокумент.DocNumber;
			Элемент.StatusDownload = Ложь;
			Элемент.Description = "Загрузка не выполнена. "+?(стрСообщение = "", "",стрСообщение);
			РезСтруктура.ReturnDownloadStatusFor1CList.Добавить(Элемент);
		КонецЕсли;
		
	КонецЦикла;
	
	
	
	Возврат РезСтруктура;
КонецФункции // СоздатьДокументыИзТСД()
